[{"source":"remoteok","title":"Vice President Customer Support","company":"Vultr","applyUrl":"https://remoteOK.com/remote-jobs/remote-vice-president-customer-support-vultr-1129236","description":"Who We Are\nVultr is on a mission to make high-performance cloud infrastructure easy to use, affordable, and locally accessible for enterprises and AI innovators around the world. With 32 global cloud data center locations, Vultr is trusted by hundreds of thousands of active customers across 185 countries for its flexible, scalable, global Cloud Compute, Cloud GPU, Bare Metal, and Cloud Storage sol","tags":["support","cloud"],"skills":["customer support","sem"],"location":"Remote","remote":true,"score":6},{"source":"remoteok","title":"Veterinarian Joliet IL","company":"Heartstrings Pet Hospice, In-Home Euthanasia & Aftercare","applyUrl":"https://remoteOK.com/remote-jobs/remote-veterinarian-joliet-il-heartstrings-pet-hospice-in-home-euthanasia-aftercare-1129168","description":"<p>Experience Fulfillment at Heartstrings Pet Hospice! Join Our Team as an In-Home Veterinarian in Joliet &amp; Kankakee and other areas such as Plainfield, New Lenox, Lockport, Mokena and Frankfort.. </p><p>Are you looking for a refreshing change from in-clinic practice? Do you want to reconnect with pet families and provide the compassionate care you've always envisioned, with generous appointme","tags":["training","support","mobile","health","non tech"],"skills":["sem"],"location":"","remote":false,"score":6},{"source":"arbeitnow","title":"L1 Support (m/f/d)","company":"Boardwise GmbH","applyUrl":"https://www.arbeitnow.com/jobs/companies/boardwise-gmbh/l1-support-berlin-185787","description":"<h2>Your mission</h2>\n<ul>\n<li>Manage demo and customer environments, ensuring smooth updates and configurations</li>\n<li>Handle incoming support requests, classify issues, and provide basic troubleshooting</li>\n<li>Support users with application configuration and testing</li>\n<li>Escalate complex issues to technical support, ensuring a seamless transition</li>\n<li>Contribute to maintaining a know","tags":["Remote","Software Development"],"skills":["content"],"location":"Remote","remote":true,"score":6},{"source":"remoteok","title":"PHP Laravel Developer Needed ROCKSTARS ONLY","company":"Agent Legend","applyUrl":"https://remoteOK.com/remote-jobs/remote-php-laravel-developer-needed-rockstars-only-agent-legend-1129233","description":"<h1>If you are looking for a comfy gig that doesn't challenge you to think differently and get creative...please do not apply for this role. </h1><p>WE ARE LOOKING TO HAND SELECT A SKILLED DEVELOPER TO REPORT DIRECTLY TO OUR CTO AND CEO!</p><p>Details around this role can be found below. </p><p>In order to be considered for this role, please include one of your favorite jokes!!! That way we know","tags":["php","laravel","dev"],"skills":["crm"],"location":"","remote":false,"score":4},{"source":"remoteok","title":"French Speaking Jobs Greece Work Greece Fully Paid Relocation Package","company":"Mercier Consultancy MD","applyUrl":"https://remoteOK.com/remote-jobs/remote-french-speaking-jobs-greece-work-greece-fully-paid-relocation-package-mercier-consultancy-md-1129212","description":"<p>Mercier Consultancy MD is thrilled to announce exciting career opportunities for French-speaking individuals looking to work in Greece. This position not only offers a vibrant work environment but also includes a fully paid relocation package, making your transition as smooth as possible. Join our team and immerse yourself in a culturally rich experience while providing excellent service to our","tags":["consulting","consultancy","support"],"skills":["crm","customer support"],"location":"","remote":false,"score":4},{"source":"remoteok","title":"Business Intelligence Analyst","company":"RainFocus","applyUrl":"https://remoteOK.com/remote-jobs/remote-business-intelligence-analyst-rainfocus-1129246","description":"RainFocus, one of the most innovative software companies, is in search of an exceptional BI Intelligence Analyst. About RainFocus RainFocus cares about its employees, customers, and the world in which we live. Our rapidly growing team serves Fortune 500 companies like Adobe, Cisco, IBM, Oracle, VMware, and others to prepare and execute in-person, virtual, and hybrid events, across the world. Those","tags":["analyst","software","marketing","health"],"skills":["marketing"],"location":"Lehi","remote":false,"score":3}]